[
    {
      "medicineName": "Paracetamol",
      "genericName": "Acetaminophen",
      "shortDescription": "Paracetamol, also known as acetaminophen, is a widely used over-the-counter pain reliever and fever reducer. It is commonly used to alleviate headaches, muscle aches, arthritis, backaches, toothaches, colds, and fevers. Paracetamol works by inhibiting the production of prostaglandins, chemicals in the body that cause inflammation and pain. It is generally well-tolerated, with minimal side effects when taken as directed. However, overdosing on paracetamol can lead to severe liver damage. It is available in various forms including tablets, capsules, syrups, and suppositories, making it versatile for different age groups and preferences.",
      "medicineImage": "https://example.com/images/paracetamol.png",
      "category": "tablet",
      "medicineCompany": "Pharma Inc.",
      "massUnit": "500 mg",
      "perUnitPrice": 0.50,
      "discountPercentage": 0
    },
    {
      "medicineName": "Amoxicillin",
      "genericName": "Amoxicillin",
      "shortDescription": "Amoxicillin is a penicillin-type antibiotic used to treat a wide variety of bacterial infections. It is effective against infections such as bronchitis, pneumonia, and infections of the ears, nose, throat, skin, and urinary tract. Amoxicillin works by inhibiting the growth of bacteria, making it a vital medication in combating bacterial infections. It is often prescribed in capsule form but is also available as a liquid suspension for children or those who have difficulty swallowing pills. Despite its effectiveness, it is crucial to complete the full course of treatment as prescribed to prevent antibiotic resistance.",
      "medicineImage": "https://example.com/images/amoxicillin.png",
      "category": "capsules",
      "medicineCompany": "HealthCorp",
      "massUnit": "250 mg",
      "perUnitPrice": 0.75,
      "discountPercentage": 0
    },
    {
      "medicineName": "Cough Syrup",
      "genericName": "Dextromethorphan",
      "shortDescription": "Cough Syrup with dextromethorphan is commonly used to provide relief from persistent coughing. This syrup acts on the brain to suppress the cough reflex, making it particularly effective for dry, irritating coughs. It also helps in soothing the throat and reducing discomfort caused by continuous coughing. Suitable for adults and children, the syrup often contains additional ingredients like honey or menthol for extra soothing effects. It is important to use the syrup as directed and not exceed the recommended dosage to avoid potential side effects such as dizziness or drowsiness.",
      "medicineImage": "https://example.com/images/cough_syrup.png",
      "category": "syrup",
      "medicineCompany": "Wellness Ltd.",
      "massUnit": "100 ml",
      "perUnitPrice": 5.00,
      "discountPercentage": 0
    },
    {
      "medicineName": "Ibuprofen",
      "genericName": "Ibuprofen",
      "shortDescription": "Ibuprofen is a widely used nonsteroidal anti-inflammatory drug (NSAID) that helps reduce pain, inflammation, and fever. It is commonly used for managing conditions such as arthritis, menstrual cramps, headaches, muscle aches, and minor injuries. Ibuprofen works by inhibiting the enzymes that produce prostaglandins, which are responsible for inflammation and pain in the body. Available in various forms like tablets, capsules, and gels, it is an essential medication for many people. However, it should be used cautiously, as prolonged use can lead to side effects such as stomach ulcers or kidney issues.",
      "medicineImage": "https://example.com/images/ibuprofen.png",
      "category": "tablet",
      "medicineCompany": "Medico",
      "massUnit": "200 mg",
      "perUnitPrice": 0.30,
      "discountPercentage": 0
    },
    {
      "medicineName": "Vitamin D",
      "genericName": "Cholecalciferol",
      "shortDescription": "Vitamin D, specifically cholecalciferol, is a crucial nutrient that supports overall health, particularly bone health. It helps the body absorb calcium and phosphorus from the diet, which are essential for maintaining strong bones and teeth. Vitamin D also plays a role in supporting the immune system, brain, and nervous system. It is produced by the body when the skin is exposed to sunlight but can also be obtained through supplements, especially in regions with limited sunlight. Regular intake of Vitamin D is vital for preventing conditions like rickets in children and osteomalacia or osteoporosis in adults.",
      "medicineImage": "https://i.ibb.co/X78P5Hf/vit-D3-front-2-removebg-preview-1.png",
      "category": "capsules",
      "medicineCompany": "NutriHealth",
      "massUnit": "1000 IU",
      "perUnitPrice": 0.20,
      "discountPercentage": 10
    },
    {
      "medicineName": "Insulin",
      "genericName": "Insulin Glargine",
      "shortDescription": "Insulin Glargine is a long-acting insulin used to manage blood sugar levels in individuals with diabetes mellitus. It helps control hyperglycemia over a 24-hour period by facilitating the uptake of glucose into tissues and reducing glucose production in the liver. Administered via subcutaneous injection, Insulin Glargine is typically used once daily to provide consistent insulin levels. Proper management of blood sugar with insulin is crucial for preventing complications associated with diabetes, such as nerve damage, kidney damage, and cardiovascular diseases. Regular monitoring and adherence to the prescribed regimen are essential for effective diabetes management.",
      "medicineImage": "https://i.ibb.co/MRD9zhv/Prozinc-Canine-removebg-preview-1.png",
      "category": "injection",
      "medicineCompany": "Diabetes Care",
      "massUnit": "10 ml",
      "perUnitPrice": 30.00,
      "discountPercentage": 20
    },
    {
      "medicineName": "Vitamin",
      "genericName": "Multivitamin",
      "shortDescription": "Multivitamins are dietary supplements that contain a combination of vitamins and minerals to support overall health and well-being. They are designed to fill nutritional gaps in the diet and ensure the body gets essential nutrients it may not obtain from food alone. Multivitamins can support various bodily functions, including immune function, energy production, and bone health. They are available in different forms such as tablets, capsules, and gummies, making them suitable for people of all ages. Regular intake of multivitamins can help prevent deficiencies and promote optimal health.",
      "medicineImage": "https://i.ibb.co/SrCbHMt/71-Xfnf-Ttu-IL-removebg-preview-1.png",
      "category": "tablet",
      "medicineCompany": "VitaHealth",
      "massUnit": "22 tablet",
      "perUnitPrice": 1,
      "discountPercentage": 15
    },
    {
      "medicineName": "Cetirizine",
      "genericName": "Cetirizine Hydrochloride",
      "shortDescription": "Cetirizine is an antihistamine used to relieve allergy symptoms such as watery eyes, runny nose, itching eyes/nose, and sneezing. It is also effective in treating hives and itching. Cetirizine works by blocking a natural substance called histamine that the body makes during an allergic reaction. It is a non-drowsy formula, making it suitable for daily use without interfering with activities that require alertness. Available in tablets, liquid, and chewable forms, cetirizine provides versatile options for individuals of different ages and preferences. It is important to follow the dosage instructions to avoid potential side effects.",
      "medicineImage": "https://example.com/images/cetirizine.png",
      "category": "tablet",
      "medicineCompany": "Allergy Relief",
      "massUnit": "10 mg",
      "perUnitPrice": 0.40,
      "discountPercentage": 0
    },
    {
      "medicineName": "Digital Meter",
      "genericName": "Blood Pressure Meter",
      "shortDescription": "A Blood Pressure Monitor is a health device used to measure and track blood pressure levels. It is an essential tool for individuals with hypertension or other cardiovascular conditions. The monitor typically includes an inflatable cuff, a gauge, and a stethoscope or digital display. Modern blood pressure monitors are often automated, providing easy and accurate readings with minimal user input. Regular monitoring of blood pressure can help in the early detection of potential health issues and assist healthcare providers in managing and adjusting treatment plans. It is a valuable device for maintaining cardiovascular health.",
      "medicineImage": "https://i.ibb.co/xh6nnGt/51-Vh-Yc-SGw-L-AC-SL1000-removebg-preview-1.png",
      "category": "health device",
      "medicineCompany": "Health Devices Ltd.",
      "massUnit": "1 unit",
      "perUnitPrice": 100.00,
      "discountPercentage": 20
    },
    {
      "medicineName": "Hydrocortisone Cream",
      "genericName": "Hydrocortisone",
      "shortDescription": "Hydrocortisone Cream is a topical corticosteroid used to treat skin conditions such as eczema, psoriasis, and allergic reactions. It helps reduce inflammation, itching, and redness by suppressing the immune response in the affected area. The cream is applied directly to the skin and is suitable for short-term use to manage flare-ups of skin conditions. It is important to use hydrocortisone cream as directed by a healthcare provider to avoid potential side effects such as thinning skin or hormonal imbalances. It provides effective relief from discomfort and helps restore healthy skin.",
      "medicineImage": "https://i.ibb.co/QcnqfKt/HYDROCORTISONE-1-WW-CREAM-EL-0000001025212-1-removebg-preview.png",
      "category": "personal product",
      "medicineCompany": "SkinCare Inc.",
      "massUnit": "30 g",
      "perUnitPrice": 8.00,
      "discountPercentage": 15
    },
    {
      "medicineName": "Cough Drops",
      "genericName": "Menthol",
      "shortDescription": "Cough Drops containing menthol are a popular remedy for soothing sore throats and relieving coughs. The menthol in the drops acts as a mild anesthetic and cooling agent, providing immediate relief from throat irritation and discomfort. They are convenient to use and can be carried easily for on-the-go relief. Cough drops come in various flavors and can also help in freshening breath. They are suitable for adults and children and can be used throughout the day as needed. It is important to follow the recommended usage to avoid excessive intake of menthol.",
      "medicineImage": "https://example.com/images/cough_drops.png",
      "category": "personal product",
      "medicineCompany": "Wellness Ltd.",
      "massUnit": "5 mg",
      "perUnitPrice": 0.05,
      "discountPercentage": 0
    },
    {
        "medicineName": "Digital Meter",
        "genericName": "Inhaler Pressure Meter",
        "shortDescription": "The Inhaler Pressure Meter is a vital health device designed to measure the pressure and remaining dosage in inhalers. This tool is essential for individuals who rely on inhalers to manage respiratory conditions such as asthma, COPD (Chronic Obstructive Pulmonary Disease), and other lung-related diseases. The pressure meter attaches easily to the inhaler and provides an accurate reading of the internal pressure, ensuring that users can monitor their medication usage effectively. By using the Inhaler Pressure Meter, patients can avoid unexpected medication depletion, which can be critical during asthma attacks or other respiratory emergencies. The device is compact, portable, and user-friendly, making it convenient for daily use. Regular monitoring with this meter helps in maintaining proper medication adherence and ensures that the inhaler is functioning correctly, thus contributing to better overall respiratory health.",
        "medicineImage": "https://i.ibb.co/wdxggvc/product7-1-removebg-preview.png",
        "category": "health device",
        "medicineCompany": "Respiratory Solutions Ltd.",
        "massUnit": "1 unit",
        "perUnitPrice": 25.00,
        "discountPercentage": 10
      }
  ]
  